tap "fsouza/prettierd"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ms-jpq/sad"
tap "snyk/tap"
tap "yakitrak/yakitrak"
brew "act"
brew "ansilove"
brew "libyaml"
brew "readline"
brew "ruby"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bison"
brew "node"
brew "bitwarden-cli"
brew "bottom", args: ["HEAD"]
brew "gettext"
brew "harfbuzz"
brew "chafa"
brew "chruby"
brew "cmake"
brew "cocoapods"
brew "libslirp"
brew "colima"
brew "coreutils"
brew "cpanminus"
brew "csview"
brew "curl"
brew "deno"
brew "detox"
brew "docker"
brew "docker-buildx"
brew "docker-credential-helper"
brew "exiv2"
brew "fd", args: ["HEAD"]
brew "ffmpeg"
brew "figlet"
brew "fnm", args: ["HEAD"]
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdbm"
brew "gh"
brew "ghq", args: ["HEAD"]
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "helix"
brew "helm"
brew "hexyl"
brew "jq"
brew "kubernetes-cli"
brew "lazygit", args: ["HEAD"]
brew "lf"
brew "llvm"
brew "python@3.11"
brew "lsd"
brew "lsix"
brew "lua"
brew "lua-language-server"
brew "luacheck"
brew "luarocks", args: ["HEAD"]
brew "make"
brew "marksman"
brew "mercurial"
brew "micro"
brew "microplane"
brew "neofetch", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "odt2txt"
brew "onefetch"
brew "openjdk"
brew "openjdk@17"
brew "openssl@1.1"
brew "pandoc"
brew "poppler"
brew "python-gdbm@3.11"
brew "python-tk@3.11"
brew "ripgrep", args: ["HEAD"]
brew "ripgrep-all", args: ["HEAD"]
brew "ruby-install"
brew "sd"
brew "sevenzip"
brew "shfmt"
brew "silicon"
brew "sk"
brew "spotify_player"
brew "starship", args: ["HEAD"]
brew "stylua"
brew "the_silver_searcher"
brew "tig"
brew "timg"
brew "tldr", args: ["HEAD"]
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "typescript-language-server"
brew "universal-ctags"
brew "vifm"
brew "vim", args: ["HEAD"]
brew "vint"
brew "viu"
brew "w3m"
brew "watchman"
brew "wget"
brew "xsv"
brew "yaml-language-server"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "fsouza/prettierd/prettierd"
brew "snyk/tap/snyk"
cask "alacritty"
cask "altair-graphql-client"
cask "appcleaner"
cask "arc"
cask "bitwarden"
cask "brave-browser"
cask "deepl"
cask "discord"
cask "firefox"
cask "font-iosevka-nerd-font"
cask "font-iosevka-ss15"
cask "font-symbols-only-nerd-font"
cask "kindle"
cask "kitty"
cask "logi-options-plus"
cask "neovide"
cask "obsidian"
cask "postman"
cask "rar"
cask "raycast"
cask "sequel-ace"
cask "signal"
cask "spotify"
cask "visual-studio-code-insiders"
cask "vlc"
cask "wezterm-nightly"
cask "whatsapp"
cask "zed"
